<a href="https://colab.research.google.com/github/changsksu/IMSE_Data_Science/blob/main/SQLite_two_tables_setup_and_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

This code aims to demonstate the use of two tables connected by a third table with keys

In [1]:
import sqlite3

In [2]:
# the name of the db is called HR.db
# SQLite will create this db if it does not exist, otherwise it will be connected
conn=sqlite3.connect('HR2.db')

In [3]:
# the name of two tables are Department & Employees
# all datat based reserve words are in capital letters for clarification
conn.execute('''
CREATE TABLE IF NOT EXISTS Departments (
            Code INTEGER PRIMARY KEY NOT NULL,
            Name Text NOT NULL,
            Budget REAL NOT NULL
);''')
conn.commit()
print("Departments table created")

Departments table created

In [4]:
# the name of two tables are Department & Employees
# all datat based reserve words are in capital letters for clarification
conn.execute('''
CREATE TABLE IF NOT EXISTS Employees (
            SID INTEGER PRIMARY KEY NOT NULL,
            Name Text NOT NULL,
            LastName VARCHAR NOT NULL,
            Department INTEGER NOT NULL,
            Salary INTEGER NOT NULL,
            CONSTRAINT fk_Department_code FOREIGN KEY(Department)
            REFERENCES Departments(Code)
);''')
conn.commit()
print("Employees table created")

Employees table created

In [5]:
# insert data into the Departments table
# since the data is already there and the primary key will prevent a new entry witht the same key
conn.execute("INSERT INTO Departments(Code, Name, Budget) VALUES(14, 'IT', 650000);")
conn.execute("INSERT INTO Departments(Code, Name, Budget) VALUES(37, 'Accounting', 150000);")
conn.execute("INSERT INTO Departments(Code, Name, Budget) VALUES(59, 'Human Resources', 250000);")
conn.execute("INSERT INTO Departments(Code, Name, Budget) VALUES(77, 'R&D', 550000);")

In [6]:
conn.execute("INSERT INTO Employees(SID, Name, LastName, Department, Salary) VALUES(1, 'John', 'Smith', 14, 85000);")
conn.execute("INSERT INTO Employees(SID, Name, LastName, Department, Salary) VALUES(2, 'Jim', 'Anderson', 14, 95000);")
conn.execute("INSERT INTO Employees(SID, Name, LastName, Department, Salary) VALUES(3, 'Jane', 'Doe', 37, 45000);")
conn.execute("INSERT INTO Employees(SID, Name, LastName, Department, Salary) VALUES(4, 'Sarah', 'Smith', 59, 55000);")
conn.execute("INSERT INTO Employees(SID, Name, LastName, Department, Salary) VALUES(5, 'Nick', 'Tesla', 77, 105000);")

In [7]:
# Use SQL command to retrieva all data
outcome=conn.execute("SELECT * FROM Departments")
for row in outcome:
    print(row)

(14, 'IT', 650000.0)
(37, 'Accounting', 150000.0)
(59, 'Human Resources', 250000.0)
(77, 'R&D', 550000.0)

In [29]:
# Use SQL command to retrieva all data from the Employees table
outcome=conn.execute("SELECT * FROM Employees")
for row in outcome:
    print(row)

(1, 'John', 'Smith', 14, 85000)
(2, 'Jim', 'Anderson', 14, 95000)
(3, 'Jane', 'Doe', 37, 45000)
(4, 'Sarah', 'Smith', 59, 55000)
(5, 'Nick', 'Tesla', 77, 105000)
(6, 'Jane', 'Doe', 14, 85500)

In [9]:
# 1. conditional SQL for all departments with annual budget over 500K
outcome=conn.execute("SELECT * FROM Departments WHERE Budget > 500000")
for row in outcome:
    print(row)

(14, 'IT', 650000.0)
(77, 'R&D', 550000.0)

In [10]:
# 2. List all employees in the IT department
# Note that the we already know the IT code is 14
outcome=conn.execute("SELECT name, LastName FROM Employees WHERE Department = 14")
for row in outcome:
    print(row)

('John', 'Smith')
('Jim', 'Anderson')

In [11]:
# What if we don't know the IT code
# We use JOIN ON to link two tables: Employees.Depart is linked to Departments.code

outcome=conn.execute("SELECT Employees.Name, LastName FROM Employees JOIN Departments ON Employees.Department = Departments.code WHERE Departments.Name = 'IT'")
for row in outcome:
    print(row)

('John', 'Smith')
('Jim', 'Anderson')

In [27]:
conn.execute("INSERT INTO Employees(SID, Name, LastName, Department, Salary) VALUES(6, 'Jane', 'Doe', 14, 85500);")

In [28]:
# 3. Sort all employees by department code
# Your turn: finish the missing information
# DESC for decending order
outcome=conn.execute('''
SELECT Departments.Name, Employees.Name, LastName
FROM Employees JOIN Departments ON Employees.Department = Departments.code
ORDER BY Departments.name ASC, Employees.LastName ASC;
''')
for row in outcome:
    print(row)

('Accounting', 'Jane', 'Doe')
('Human Resources', 'Sarah', 'Smith')
('IT', 'Jim', 'Anderson')
('IT', 'Jane', 'Doe')
('IT', 'John', 'Smith')
('R&D', 'Nick', 'Tesla')

In [32]:
# 5 Who is the highest paid employee
# function MAX() is used
outcome=conn.execute("SELECT Name, LastName, MAX(Salary) FROM Employees")
for row in outcome:
    print(row)

('Nick', 'Tesla', 105000)

In [14]:
# 6 How many employees in the research (R&D) department
outcome=conn.execute('''
SELECT COUNT(*)
FROM Employees JOIN Departments ON Employees.Department = Departments.code
WHERE Departments.Name = 'R&D';
''')
for row in outcome:
    print(row)

(1,)

In [35]:
# 6a How is the average salary of each departments?
outcome=conn.execute('''
SELECT Departments.Name, AVG(Employees.salary)
FROM Employees JOIN Departments ON Employees.Department = Departments.code
GROUP BY Departments.Name;
''')

for row in outcome:
    print(row)

('Accounting', 45000.0)
('Human Resources', 55000.0)
('IT', 88500.0)
('R&D', 105000.0)

In [33]:
# List employees in the All departments (in decending order)
outcome=conn.execute('''
SELECT Departments.Name, Employees.Name
FROM Employees JOIN Departments ON Employees.Department = Departments.code
ORDER BY Departments.Name DESC;
''')
for row in outcome:
    print(row)

('R&D', 'Nick')
('IT', 'John')
('IT', 'Jim')
('IT', 'Jane')
('Human Resources', 'Sarah')
('Accounting', 'Jane')

In [34]:
# 7. Count how many employees in the each departments
outcome=conn.execute('''
SELECT Departments.Name, COUNT(Employees.Name)
FROM Employees JOIN Departments ON Employees.Department = Departments.code
GROUP BY Departments.Name;
''')
for row in outcome:
    print(row)

('Accounting', 1)
('Human Resources', 1)
('IT', 3)
('R&D', 1)

In [38]:
# why is the IT missing one employee? what if GROUP BY is changed to ORDER BY?
outcome=conn.execute('''
SELECT Departments.Name, Employees.Name, Employees.LastName
FROM Employees JOIN Departments ON Employees.Department = Departments.code
GROUP BY Departments.Name;
''')
for row in outcome:
    print(row)

('Accounting', 'Jane', 'Doe')
('Human Resources', 'Sarah', 'Smith')
('IT', 'John', 'Smith')
('R&D', 'Nick', 'Tesla')